In [1]:
%load_ext sql

In [56]:
import os

USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

import psycopg2

with psycopg2.connect(
    dbname='jovyan'
) as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT datname FROM pg_database')
        records = cur.fetchall()
        
print(records)

[('postgres',), ('jovyan',), ('template1',), ('template0',)]

In [57]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)
CONNECT_DATA

'postgresql://reader:Miba2021@10.129.0.25/demo'

## Task 1

In [37]:
%%sql $CONNECT_DATA
SELECT ticket_no, COUNT(flight_id) as flights
FROM ticket_flights
GROUP BY ticket_no
HAVING COUNT(flight_id) > 3
LIMIT 100

100 rows affected.

[('0005432312163', 4),
 ('0005432312164', 4),
 ('0005432312165', 4),
 ('0005432312166', 4),
 ('0005432312167', 4),
 ('0005432312168', 4),
 ('0005432312169', 4),
 ('0005432312170', 4),
 ('0005432312171', 4),
 ('0005432312172', 4),
 ('0005432312173', 4),
 ('0005432312174', 4),
 ('0005432312175', 4),
 ('0005432312176', 4),
 ('0005432312177', 4),
 ('0005432312178', 4),
 ('0005432312179', 4),
 ('0005432312180', 4),
 ('0005432312181', 4),
 ('0005432312182', 4),
 ('0005432312183', 4),
 ('0005432312184', 4),
 ('0005432312185', 4),
 ('0005432312186', 4),
 ('0005432312187', 4),
 ('0005432312188', 4),
 ('0005432312189', 4),
 ('0005432312190', 4),
 ('0005432312191', 4),
 ('0005432312192', 4),
 ('0005432312193', 4),
 ('0005432312194', 4),
 ('0005432312195', 4),
 ('0005432312196', 4),
 ('0005432312197', 4),
 ('0005432312198', 4),
 ('0005432312199', 4),
 ('0005432312200', 4),
 ('0005432312201', 4),
 ('0005432312202', 4),
 ('0005432312203', 4),
 ('0005432312204', 4),
 ('0005432312205', 4),
 ('0005432312206', 4),
 ('0005432312207', 4),
 ('0005432312208', 4),
 ('0005432312209', 4),
 ('0005432312210', 4),
 ('0005432312211', 4),
 ('0005432312212', 4),
 ('0005432312213', 4),
 ('0005432312214', 4),
 ('0005432312215', 4),
 ('0005432312216', 4),
 ('0005432312217', 4),
 ('0005432312218', 4),
 ('0005432312219', 4),
 ('0005432312220', 4),
 ('0005432312221', 4),
 ('0005432312222', 4),
 ('0005432312223', 4),
 ('0005432312224', 4),
 ('0005432312225', 4),
 ('0005432312226', 4),
 ('0005432312227', 4),
 ('0005432312228', 4),
 ('0005432312229', 4),
 ('0005432312230', 4),
 ('0005432312231', 4),
 ('0005432312232', 4),
 ('0005432312233', 4),
 ('0005432312234', 4),
 ('0005432312235', 4),
 ('0005432312236', 4),
 ('0005432312237', 4),
 ('0005432312238', 4),
 ('0005432312239', 4),
 ('0005432312240', 4),
 ('0005432312241', 4),
 ('0005432312242', 4),
 ('0005432312243', 4),
 ('0005432312244', 4),
 ('0005432312245', 4),
 ('0005432312246', 4),
 ('0005432312247', 4),
 ('0005432312248', 4),
 ('0005432312249', 4),
 ('0005432312250', 4),
 ('0005432312251', 4),
 ('0005432312252', 4),
 ('0005432312253', 4),
 ('0005432312254', 4),
 ('0005432312255', 4),
 ('0005432312256', 4),
 ('0005432312257', 4),
 ('0005432312258', 4),
 ('0005432312259', 4),
 ('0005432312260', 4),
 ('0005432312261', 4),
 ('0005432312262', 4)]

In [78]:
%%sql $CONNECT_DATA
select count(*) as total_number from 
    (SELECT ticket_no, COUNT(flight_id) as flights
    FROM ticket_flights
    GROUP BY ticket_no
    HAVING COUNT(flight_id) > 3) as sub

1 rows affected.

[(1276708,)]

## Task 2

In [52]:
%%sql $CONNECT_DATA
SELECT COUNT(*) as tickets_with_5_flights
FROM
(SELECT COUNT(ticket_no)
    FROM ticket_flights tf
    GROUP BY ticket_no
    HAVING COUNT(*) = 5) as total_number

1 rows affected.

[(54,)]

## Task 3

In [58]:
%%sql postgresql:///jovyan
CREATE TABLE employees(
    employee_id int NOT NULL,
    first_name varchar(20) NOT NULL,
    last_name varchar(20) NOT NULL,
    hire_date date NOT NULL,
    job_id varchar(20) NOT NULL,
    manager_id int NOT NULL,
    department_id int NOT NULL 
    );

Done.

[]

In [59]:
%%sql postgresql:///jovyan
CREATE TABLE departments(
    department_id int NOT NULL,
    department_name varchar(20) NOT NULL,
    manager_id int NOT NULL);

Done.

[]

In [66]:
%%sql postgresql:///jovyan
insert into employees(employee_id, first_name,last_name,hire_date,job_id, manager_id,department_id) values
(100,'Steven', 'King', '1987-06-17','AD_PRES', 0,90),
(101,'Neena', 'Kochhar', '1987-06-18','AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-24', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', 101, 100),
(109, 'Daniel' ,'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', 110, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(144, 'Peter', 'Vargas', '1987-07-31', 'PU_CLERK', 114, 50),
(145,'John', 'Russell', '1987-08-01', 'ST_CLERK' , 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);

12 rows affected.

[]

In [60]:
%%sql postgresql:///jovyan
insert into departments(department_id, department_name, manager_id) values
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205)

10 rows affected.

[]

In [61]:
%sql select * from departments

 * postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
10 rows affected.

[(10, 'Administration', 200),
 (30, 'Purchasing', 114),
 (40, 'HumanResources', 203),
 (50, 'Shipping', 121),
 (60, 'IT', 103),
 (70, 'PublicRelations', 204),
 (80, 'Sales', 145),
 (90, 'Executive', 100),
 (100, 'Finance', 108),
 (110, 'Accounting', 205)]

In [67]:
%sql select * from employees

 * postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
12 rows affected.

[(100, 'Steven', 'King', datetime.date(1987, 6, 17), 'AD_PRES', 0, 90),
 (101, 'Neena', 'Kochhar', datetime.date(1987, 6, 18), 'AD_VP', 100, 90),
 (102, 'Lex', 'DeHaan', datetime.date(1987, 6, 19), 'AD_VP', 100, 90),
 (103, 'Alexander', 'Hunold', datetime.date(1987, 6, 20), 'IT_PROG', 102, 60),
 (107, 'Diana', 'Lorentz', datetime.date(1987, 6, 24), 'IT_PROG', 103, 60),
 (108, 'Nancy', 'Greenberg', datetime.date(1987, 6, 25), 'FI_MGR', 101, 100),
 (109, 'Daniel', 'Faviet', datetime.date(1987, 6, 26), 'FI_ACCOUNT', 108, 100),
 (114, 'Den', 'Raphaely', datetime.date(1987, 7, 1), 'PU_MAN', 110, 30),
 (118, 'Guy', 'Himuro', datetime.date(1987, 7, 5), 'PU_CLERK', 114, 30),
 (144, 'Peter', 'Vargas', datetime.date(1987, 7, 31), 'PU_CLERK', 114, 50),
 (145, 'John', 'Russell', datetime.date(1987, 8, 1), 'ST_CLERK', 100, 80),
 (146, 'Karen', 'Partners', datetime.date(1987, 8, 2), 'SA_MAN', 100, 80)]

## Task 4

In [77]:
%%sql postgresql:///jovyan
select department_name, first_name, last_name, hire_date from employees e
join departments d on e.department_id = d.department_id
where e.hire_date = (select min(hire_date) from employees)

1 rows affected.

[('Executive', 'Steven', 'King', datetime.date(1987, 6, 17))]